sections = {
    '交易前': [
        {'搜索': '火币官网|官网[地网]址|下载地址'},
        {'邀请': '邀请|推荐|返佣|佣金|海报'},
        {'下载': '下载|应用商店|应用中心｜app.{0,5}升级'},
        {'账号': '注册|登陆|登录|手机号|邮箱|ga|google认证|谷歌[认验]|验证|注销|.{1}c认证|密码|账号'},
    ],
    '交易中': [
        {'认证': '认证|人脸|身份证|国籍|证件'},
        {'划转': '划转'},
        {'出入金': [
            {'链上充提': '钱包地址|充币地址|提币地址|充币|提币|erc|trc|omni|链路|充提'},
            {'法币交易': '法币|商家|放款|放币|买币|卖币|冻卡|[买卖].{1,7}usdt|退款|购买|银行卡|微信|支付宝|提现|充值'}
        ]},
        {'现货': [
            {'币币交易': '币币.*?'},
            {'杠杆交易': '杠杆.*?'},
            {'网格交易': '网格.*?|策略.*?'}
        ]},
        {'合约': [
            {'期货合约': '合约|爆仓|强制平仓|交割|结算|资金费'},
            {'期权合约': '期权'},
        ]},
        {'矿池': '矿池'},
        {'金融业务': '挖矿宝|primepool|eth2.0'},
    ],
    '交易后': [
        {'客服': '客服'},
        {'网络': '断网|网线|掉线|卡顿|[无没]网|网络'},
        {'诈骗': '诈骗|冒充'},
    ],
}

problems = {
    '搜索': [
        {'地址': [
            {'官网地址': '官网[网地]址|火币网址|火币官网'},
            {'火信地址': '火信.{0,5}?下载|下载火信'},
            {'APP下载地址': 'app.{0,5}?[链连]接'},
            {'钱包下载地址': '钱包下载|下载.{0,5}钱包|钱包.{0,5}链接'},
        ]},
    ],
    '邀请': [
        {'邀请返佣': [
            {'返佣规则咨询': '邀请.*?[返利佣金奖励]|返佣比例|申请返佣'},
            {'佣金记录查询': '[佣利].*?详情|[佣利].*?查看|邀请详情|返佣[明细数据]'},
            {'佣金未到账': '[佣利].{0,5}?到账'}
        ]},
        {'邀请方式': [
            {'二维码': '海报邀请|邀请.{0,10}?二维码|二维码邀请'},
            {'链接': '邀请.*?链接'}
        ]},
        {'邀请收不到验证码': [
            {'收不到验证码': '邀请.*?收不到验证码'}
        ]},
        {'邀请网络问题': [
            {'网络问题': '[邀请分享码].{0,10}?打不开|[邀请分享码].{0,10}?[网络无显示]'}
        ]}
    ],
    '下载': [
        {'下载指南': [
            {'下载指南': '[怎么如何].{0,10}?下载|下载链接'},
        ]},
        {'APP下载': [
            {'无法下载': '[无法不能].{0,5}?下载|下载[不了失败]'},
            {'无法升级': '钱包.{0,10}?升级|无法升级|不支持升级'},
        ]},
    ],
    '账号': [
        {'注册': [
            {'注册指南': '[如何怎么].{0,5}?注册'},
            {'收不到验证码': '注册.*?收不到.{0,4}验证码'},
            {'多账号注册咨询': '多个账号'},
            {'注册失败': '注册.{0,10}?[失败]|注册不了|无法注册|不能注册'},
        ]},
        {'3C': [
            {'绑定3C指南': '绑.{0,3}[手机邮箱谷歌]'},
            {'解绑3C指南': '解.{0,3}[手机邮箱谷歌]'},
            {'更换3C指南': '[更修].{0,3}[手机邮箱谷歌]'},
        ]},
        {'登录': [
            {'登录失败': '登录失败|登录不上'},
            {'收不到验证码': '登录.*?收不到验证码'},
        ]},
        {'账号密码': [
            {'账号找回': '找回.{0,10}?账号|账号找回|忘.{0,5}?账号|账号.{0,5}?忘'},
            {'密码找回': '找回.{0,10}?密码|密码找回|忘.{0,5}?密码|密码.{0,5}?忘|密码找不到'},
            {'密码修改': '修改.{0,5}?密码|换.{0,5}?密码|改.{0,5}?密码|密码修改'},
        ]},
        {'冻结': [
            {'账号解冻': '账号冻结|账号解冻'},
        ]},
        {'火币钱包': [
            {'登陆失败': '钱包.{0,5}?登[录陆]'},
            {'账号查看': '钱包.{0,5}?账号'},
            {'钱包地址': '钱包地址'},
        ]},
        {'账号注销': [
            {'注销指南': '注销'},
        ]},
        {'账户限制': [
            {'限制交易':'限制交易'},
        ]}
    ],
    '认证': [
        {'认证指引': [
            {'认证指南': '如何认证|怎么认证|高级认证'},
            {'权益说明': '要认证|要求.{0,5}?认证|提[币现]额度'},
            {'时效咨询': '认证.{0,5}?多久|认证.{0,5}?进度|认证.{0,5}?天|多久审核|没有审核|快点审核|审核快点|审核.*?通过'},
        ]},
        {'认证失败': [
            {'资料提交不通过': '资料提交.{0,5}?[不没]通'},
            {'个人信息被占用': '身份证.{0,5}?被.{0,5}?认证|证件.{0,3}?被认'},
            {'人脸识别失败': '人脸识别不上|无法人脸识别'},
        ]},
        {'认证修改': [
            {'认证解绑': '解绑.{0,5}?认证'},
            {'国籍修改': '国籍.{0,5}?修改|修改国籍'},
            {'证件修改': '证件.{0,10}?改'},
        ]},
        {'认证信息': [
            {'认证信息查看': '认证信息'},
        ]},
        {'c3审核': [
            {'审核进度': 'c3'},
        ]}
    ],
    '出入金': [
        {'出入金指南': [
            {'法币入金指南': '如何购买法币|如何充值|怎么充值|怎么购买|买币'},
            {'法币出金指南': '提现教程|如何提现|收款|卖币|怎么提现'},
            {'链上充币指南': '怎么充币|如何充币'},
            {'链上提币指南': '提币教程|如何提币|提币.{0,10}?视频|提币地址'},
        ]},
        {'出入金记录查询': [
            {'法币出入金记录查询': '法币.{0,5}?记录|充值记录|买.{0,4}记录|提现.{0,5}[查记录]'},
            {'链上充提币记录查询': '充提币记录|充币记录|提币记录'},
        ]},
        {'法币通道': [
            {'法币商户注册咨询': '申请.{0,5}?商户|咨询代理｜成为.{0,5}?商户|商户申请|币商|加入.{0,5}商户'},
            {'订单超时': '订单超时|确认.{0,2}?超时'},
            {'充值不到账': '充值.{0,6}?[不没未]到账[^号]|购买.{0,3}?[不没未]到账'},
            {'提现不到账': '提现[不没未]到账|资金.{1,3}?到账|卖币.{1,5}?[不没未]到账'},
            {'未付款':'未付款'},
        ]},
        {'链上通道': [
            {'充提币关停公告咨询': '[充提暂停升级].{0,5}?公告'},
            {'充提币地址咨询': '钱包地址.{0,5}?看'},
            {'充提币到账时限咨询': '[充提转].{0,5}?多久.{0,5}?到[账]?'},
            {'充币不到账': '充币.{0,5}?[不未没]到账|币没收到|钱包没到账'},
            {'提币不到账': '提.{0,5}?[不未没]到账[^号]|提.{0,5}?没收到'},
            {'充币错误找回咨询': '[充|转]错'},
            {'提币错误找回咨询': '提错'},
            {'提币收不到验证码': '提币.{0,5}不到验证码'},
            {'跨链转账咨询': '链路|通道|提币.{0,3}?网络'},
            {'链上钱包相关咨询': '钱包.{0,5}?下载|钱包.{0,5}?地址|下载.{0,5}?钱包|钱包[升级链接]'},
            {'链上转账手续费咨询': '[转提充][账币]?.{0,5}?手续费'},
            {'提币审核咨询': '提币.{0,5}?审核'},
            {'提币限额':'提币.{0,5}限额'},
            {'提币限制':'提币限制|[不无].{0,4}提币'},
            {'合约地址': '合约地址'},
        ]},
    ],
    '划转': [
        {'划转指南': [
            {'账户间划转': '怎么划转|如何划转|划转教程'},
        ]},
        {'账户划转': [
            {'限制划转': '无法.{0,5}划转|划转不了|不能划转|划转.{0,5}失败'},
        ]},
    ],
    '现货': [
        {'现货指南': [
            {'币币入门指南': '币币交易'},
            {'现货杠杆入门指南': '杠杆交易'},
            {'杠杆风险率计算规则': '杠杆.*?风险率'},
            {'手续费计算规则': '币币.{0,5}?手续费|现货.{0,5}?手续费|杠杆.{0,5}?手续费'},
            {'交易记录查询':'交易记录'}
        ]},
        {'现货杠杆': [
            {'强制平仓': '杠杆.*?强制平仓|杠杆.*?爆仓|杠杆.*?强平'},
            {'杠杆交易': '不支持.{0,5}?杠杆交易|无法.{0,5}?杠杆交易|不能.{0,5}杠杆'},
            {'开通杠杆咨询': '开通杠杆'}
        ]},
    ],
    '合约': [
        {'合约指南': [
            {'期货合约入门指南': '合约交易'},
            {'手续费计算规则': '合约手续费'},
            {'成交记录查询': '合约.{0,8}?记录|合约.{0,8}?明细'},
            {'期货合约风险率计算规则': '合约.*?风险率'},
            {'止盈止损': '止盈止损'},
        ]},
        {'期货合约': [
            {'开通合约咨询': '开通.{0,5}?合约'},
            {'合约杠杆咨询': '合约.{0,5}[杠杆倍数]|提高[杠杆倍数]|合约.{0,5}倍'},
            {'合约强平相关': '合约.*?强制平仓|合约.*?爆仓|合约.*?强平'},
        ]},
        {'业务咨询': [
            {'政策相关': '不支持.{0,5}?合约交易|无法.{0,5}?合约交易'},
        ]},
    ],
    '矿池': [
        {'矿池指南': [
            {'矿池入门指南': '矿池'},
            {'收益计算规则': '矿池.{0,10}?收益'},
            {'收益转出规则': '矿池.{0,8}?[转提解赎]|解锁'},
            {'收益记录查询': '矿池.{0,10}?收益.{0,5}?看'},
        ]},
        {'业务咨询': [
            {'政策相关': '不支持.{0,5}?矿池|无法.{0,5}?矿池'},
        ]},
    ],
    '金融业务': [
        {'金融业务指南': [
            {'挖矿宝指南': '挖矿宝'},
            {'PrimePool指南': 'PrimePool|primepool'},
            {'ETH2.0指南': 'eth2.0|ETH2.0'},
            {'收益记录查询': '挖矿宝.{0,10}?收益.{0,5}?看'},
        ]},
    ],
    '诈骗': [
        {'电话诈骗': [
            {'冒充客服': '[^名][称冒].{0,8}?客服'},
            {'冒充风控人员': '[^名][称冒].{0,8}?风控'},
        ]},
    ],
    '网络': [
        {'无网络': [
            {'登录过程': '登录.{0,10}?网络'},
            {'认证过程': '认证.{0,10}?网络'},
            {'划转过程': '划转.{0,10}?网络'},
            {'资产页面': '资产.{0,10}?网络'},
            {'现货页面': '现货.{0,10}?网络'},
            {'合约页面': '合约.{0,10}?网络'},
            {'法币页面': '法币.{0,10}?网络'},
            {'理财页面': '矿.{0,10}?网络'},
            {'火币钱包': '钱包.{0,10}?[无没]?网络.{0,5}?[异常失败]'},
            {'火信': '火信.{0,10}?网络'},
        ]},
    ],
    '客服': [
        {"客服反馈": [
            {"未反馈": "未反馈|不回复"},
            {"已反馈未解决": "未解决|没解决"},
            {"已反馈解决不及时": "解决太慢"},
            {"已解决": "已解决|已经解决"},
        ]},
    ],
}
