# -*- coding:utf-8 -*-
# Wrote by HenryFang, UEC Department, November/2021

import re
from collections import Counter
from itertools import chain

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

sections = {
    '交易前': [
        {'搜索': '火币官网|官网[地网]址'},
        {'邀请': '邀请|推荐|返佣|佣金|海报|二维码'},
        {'注册': '注册'},
        {'下载': '下载|应用商店|应用中心'},
        {'账号': '登陆|登录|手机号|邮箱|ga|google认证|谷歌[认验]|验证|注销|.{1}c认证|美[国籍]'},
    ],
    '交易中': [
        {'认证': '认证|人脸|身份证|身份'},
        {'划转': '划转|冻结'},
        {'出入金': [
            {'链上充提': '钱包|充币地址|提币地址|充币|提币|erc|trc|omni'},
            {'法币交易': '法币|商家|放款|放币|买币|卖币|冻卡|[买卖].{1,7}usdt|退款|购买|银行卡|微信|支付宝|提现|充值'}
        ]},
        {'现货': [
            {'币币交易': '币币.*?'},
            {'杠杆交易': '杠杆.*?'},
            {'网格交易': '网格.*?|策略.*?'}
        ]},
        {'合约': [
            {'期货合约': '合约|爆仓|强制平仓|交割|结算|资金费'},
            {'期权合约': '期权'},
        ]},
        {'理财': [
            {'矿池': '矿池'},
            {'挖矿宝': '挖矿'},
            {'HECO': '火币生态|heco'}
        ]},
        {'页面': [
            {'新手指南': '新手|指南|教程|文档|学习文档|学习视频|知识库'},
            {'帮助中心': '帮助|常见问题'},
            {'信息总揽': '账户信息|认证信息|持仓信息|账户明细|委托记录|成交记录|交易记录|查看.*?资产|资产查看'},
            {'活动公告': '邀请返佣|活动奖励|返佣|奖励'},
            {'交易页面': 'k线|[看盯]盘'},
        ]},
    ],
    '交易后': [
        {'客服': '客服'},
        {'网络': '断网|网线|掉线|卡顿|[无没]网|网络'}
    ],
}

problems = {
    '高级认证': [
        {'首次认证': [
            {'如何认证': '如何认证|怎么认证'},
            {'认证失败': '认证不通过'},
            {'认证时效': '什么时候通过'},
        ]},
        {'重新认证': [
            {'认证解绑': '解除认证'}
        ]},
        {'权益说明': [
            {'权益说明': '为什么要认证|要求.{0,5}认证'}
        ]}
    ],
    '期货合约': [
        {'合约': [
            {'开通合约': '合约.{0,5}开通|开通.{0,5}合约'},
            {'合约杠杆': '高倍|合约倍数'},
            {'强制平仓': '强制平仓|爆仓'}
        ]},
    ],
    '账户划转': [
        {'限制划转': '[不无限制].{0,3}划转'},
        {'冻结': '冻结'},
    ],
    '法币交易': [
        {'法币买入': [
            {'如何买入': '如何购买法币|如何充值|怎么买币'},
            {'订单超时': '订单超时'},
            {'商家放币问题': '不放币|账户.*?风险'},
            {'充值到账问题': '充值.*?到账'}
        ]},
        {'法币卖出': [
            {'如何卖出': '如何卖币'},
            {'订单超时': '订单超时'},
            {'无法提现': '无法提现'},
            {'商家放款问题': '不放款|未付款'},
            {'冻卡问题': '冻卡'},
        ]}
    ],
    '链上充提': [
        {'链上充币': [
            {'充币地址问题': '地址.*?错|钱包地址'},
            {'充币到账问题': '充币.*?到账'},
        ]},
        {'链上提币': [
            {'提币地址': '提币.*?地址'},
            {'提币到账问题': '提币.*?到账'},
            {'无法提币': '无法提币|提币冻结'}
        ]},
    ],
    '账户相关': [
        {'首次注册': [
            {'如何注册': '如何注册'},
            {'如何绑定': '如何绑定'},
            {'注册失败': '注册失败'},
        ]},
        {'已注册': [
            {'解绑相关': '解绑.{0,5}[手机邮箱ga]|[修改更换].{0,5}[手机邮箱ga]'},
            {'账户注销': '注销账户|账户注销'},
            {'修改密码': '修改.*?密码'},
            {'登陆失败': '登陆失败|收不到.*?验证码'}
        ]},
    ],
    '客服相关': [
        {'客服入口': [
            {'找客服': '客服'},
            {'等待客服': '等待｜排队'},
        ]},
        {'客服反馈': [
            {'未反馈': '未反馈|不回复'},
            {'已反馈未解决': '未解决|没解决'},
            {'已反馈解决不及时': '解决太慢'},
            {'已解决': '已解决|已经解决'}
        ]},
    ],
}

section_problem = {
    '搜索': [
        {'地址': [
            {'官网地址': '官网[网地]址|火币网址|火币官网'},
            {'火信地址': '火信.{0,5}?下载|下载火信'},
            {'APP下载地址': 'app.{0,5}?[链连]接'},
            {'钱包下载地址': '钱包下载|下载.{0,5}钱包|钱包链接'},
        ]},
    ],
    '邀请': [
        {'邀请返佣': [
            {'返佣规则咨询': '邀请.*?[返利佣金奖励]|返佣比例|申请返佣'},
            {'佣金记录查询': '[佣利].*?详情|[佣利].*?查看|邀请详情|返佣[明细数据]'},
            {'佣金未到账': '[佣利].{0,5}?到账'}
        ]},
        {'邀请方式': [
            {'二维码': '海报邀请|邀请.{0,10}?二维码|二维码邀请'},
            {'链接': '邀请.*?链接'}
        ]},
        {'邀请收不到验证码': [
            {'收不到验证码': '邀请.*?收不到验证码'}
        ]},
        {'邀请网络问题': [
            {'网络问题': '[邀请分享码].{0,10}?打不开|[邀请分享码].{0,10}?[网络无显示]'}
        ]}
    ],
    '下载': [
        {'下载指南': [
            {'下载指南': '[怎么如何].{0,10}?下载'},
        ]},
        {'APP下载': [
            {'无法下载': '[无法不能].{0,5}?下载|下载[不了失败]'},
            {'无法升级': '钱包.{0,10}?升级|无法升级|不支持升级'},
        ]},
    ],
    '账号': [
        {'注册': [
            {'注册指南': '[如何怎么].{0,5}?注册'},
            {'收不到验证码': '注册.*?收不到验证码'},
            {'多账号注册咨询': '多个账号'},
            {'注册失败': '注册.{0,10}?[失败]|注册不了|无法注册|不能注册'},
        ]},
        {'3C': [
            {'绑定3C指南': '绑定[手机邮箱谷歌]'},
            {'解绑3C指南': '解绑[手机邮箱谷歌]'},
            {'更换3C指南': '更换[手机邮箱谷歌]'},
        ]},
        {'登录': [
            {'登录失败': '登录失败|登录不上'},
            {'收不到验证码': '登录.*?收不到验证码'},
        ]},
        {'账号密码': [
            {'账号找回': '找回.{0,10}?账号|账号找回|忘.{0,5}?账号|账号.{0,5}?忘'},
            {'密码找回': '找回.{0,10}?密码|密码找回|忘.{0,5}?密码|密码.{0,5}?忘'},
            {'密码修改': '修改.{0,5}?密码|换.{0,5}?密码|改.{0,5}?密码'},
        ]},
        {'冻结': [
            {'账号解冻': '账号冻结|账号解冻'},
        ]},
        {'火币钱包': [
            {'登陆失败': '钱包.{0,5}?登[录陆]'},
            {'账号查看': '钱包.{0,5}?账号'},
        ]},
        {'账号注销': [
            {'注销指南': '注销'},
        ]},
    ],
    '认证': [
        {'认证指引': [
            {'认证指南': '如何认证|怎么认证'},
            {'权益说明': '要认证|要求.{0,5}?认证|提[币现]额度'},
            {'时效咨询': '认证.{0,5}?多久|认证.{0,5}?进度|认证.{0,5}?天|多久审核|没有审核|快点审核|审核快点'},
        ]},
        {'认证失败': [
            {'资料提交不通过': '资料提交.{0,5}?[不没]通'},
            {'个人信息被占用': '身份证.{0,5}?被.{0,5}?认证|证件.{0,3}?被认'},
            {'人脸识别失败': '人脸识别不上|无法人脸识别'},
        ]},
        {'认证修改': [
            {'认证解绑': '解绑.{0,5}?认证'},
            {'国籍修改': '国籍.{0,5}?修改|修改国籍'},
            {'证件修改': '证件.{0,10}?改'},
        ]},
        {'认证信息': [
            {'认证信息查看': '认证信息'},
        ]},
    ],
    '出入金': [
        {'出入金指南': [
            {'法币入金指南': '如何购买法币|如何充值|怎么充值|怎么购买'},
            {'法币出金指南': '提现教程|如何提现'},
            {'链上充币指南': '怎么充币|如何充币'},
            {'链上提币指南': '提币教程|如何提币|提币.{0,10}?视频'},
        ]},
        {'出入金记录查询': [
            {'法币出入金记录查询': '法币.{0,5}?记录|充值记录'},
            {'链上充提币记录查询': '充提币记录|充币记录|提币记录'},
        ]},
        {'法币通道': [
            {'法币商户注册咨询': '申请.{0,5}?商户|咨询代理｜成为.{0,5}?商户|商户申请|币商|加入.{0,5}商户'},
            {'订单超时': '订单超时|确认.{0,2}?超时'},
            {'充值不到账': '充值.{0,6}?不到账[^号]|购买.{0,3}?没到账'},
            {'提现不到账': '提现不到账|资金.{1,3}?到账|卖币.{1,5}?没到账'}
        ]},
        {'链上通道': [
            {'充提币关停公告咨询': '[充提暂停升级].{0,5}?公告'},
            {'充提币地址咨询': '钱包地址.{0,5}?看'},
            {'充提币到账时限咨询': '[充提转].{0,5}?多久.{0,5}?到[账]?'},
            {'充币不到账': '充币.{0,5}?[不没]到账|币没收到|钱包没到账'},
            {'提币不到账': '提.{0,5}?[不没]到账[^号]|提.{0,5}?没收到'},
            {'充币错误找回咨询': '[充|转]错地址'},
            {'提币错误找回咨询': '提错地址'},
            {'提币收不到验证码': '提币.{0,5}不到验证码'},
            {'跨链转账咨询': '链路|通道|提币.{0,3}?网络'},
            {'链上钱包相关咨询': '钱包.{0,5}?下载|钱包.{0,5}?地址|下载.{0,5}?钱包|钱包[升级链接]'},
            {'链上转账手续费咨询': '[转提充][账币]?.{0,5}?手续费'},
            {'提币审核咨询': '提币.{0,5}?审核'},
        ]},
    ],
    '划转': [
        {'划转指南': [
            {'账户间划转': '怎么划转|如何划转|划转教程'},
        ]},
        {'限制划转': [
            {'限制划转': '无法划转|划转不了|不能划转'},
        ]},
    ],
    '现货': [
        {'现货指南': [
            {'币币入门指南': '币币交易'},
            {'现货杠杆入门指南': '杠杆交易'},
            {'杠杆风险率计算规则': '杠杆.*?风险率'},
            {'手续费计算规则': '币币.{0,5}?手续费|现货.{0,5}?手续费|杠杆.{0,5}?手续费'},
        ]},
        {'现货杠杆': [
            {'强制平仓': '杠杆.*?强制平仓|杠杆.*?爆仓|杠杆.*?强平'},
            {'业务咨询': '不支持.{0,5}?杠杆交易|无法.{0,5}?杠杆交易'},
        ]},
    ],
    '合约': [
        {'合约指南': [
            {'期货合约入门指南': '合约交易'},
            {'手续费计算规则': '合约手续费'},
            {'成交记录查询': '合约.{0,8}?记录|合约.{0,8}?明细'},
            {'期货合约风险率计算规则': '合约.*?风险率'},
        ]},
        {'期货合约': [
            {'开通合约咨询': '开通.{0,5}?合约'},
            {'合约杠杆咨询': '合约.{0,5}杠杆'},
            {'合约强平相关': '合约.*?强制平仓|合约.*?爆仓|合约.*?强平'},
        ]},
        {'业务咨询': [
            {'政策相关': '不支持.{0,5}?合约交易|无法.{0,5}?合约交易'},
        ]},
    ],
    '矿池': [
        {'矿池指南': [
            {'矿池入门指南': '矿池'},
            {'收益计算规则': '矿池.{0,10}?收益'},
            {'收益转出规则': '矿池.{0,8}?[转提解赎]'},
            {'收益记录查询': '矿池.{0,10}?收益.{0,5}?看'},
        ]},
        {'业务咨询': [
            {'政策相关': '不支持.{0,5}?矿池|无法.{0,5}?矿池'},
        ]},
    ],
    '金融业务': [
        {'金融业务指南': [
            {'挖矿宝指南': '挖矿宝'},
            {'PrimePool指南': 'PrimePool|primepool'},
            {'ETH2.0指南': 'eth2.0|ETH2.0'},
            {'收益记录查询': '挖矿宝.{0,10}?收益.{0,5}?看'},
        ]},
    ],
    '诈骗问题': [
        {'电话诈骗': [
            {'冒充客服': '[^名][称冒].{0,8}?客服'},
            {'冒充风控人员': '[^名][称冒].{0,8}?风控'},
        ]},
    ],
    '网络问题': [
        {'无网络': [
            {'登录过程': '登录.{0,10}?网络'},
            {'认证过程': '认证.{0,10}?网络'},
            {'划转过程': '划转.{0,10}?网络'},
            {'资产页面': '资产.{0,10}?网络'},
            {'现货页面': '现货.{0,10}?网络'},
            {'合约页面': '合约.{0,10}?网络'},
            {'法币页面': '法币.{0,10}?网络'},
            {'理财页面': '矿.{0,10}?网络'},
            {'火币钱包': '钱包.{0,10}?[无没]?网络.{0,5}?[异常失败]'},
            {'火信': '火信.{0,10}?网络'},
        ]},
    ],
    '客服相关': [
        {"客服反馈": [
            {"未反馈": "未反馈|不回复"},
            {"已反馈未解决": "未解决|没解决"},
            {"已反馈解决不及时": "解决太慢"},
            {"已解决": "已解决|已经解决"},
        ]},
    ],
}

num2section = {'1': '交易前', '2': '交易中', '3': '交易后'}
section2num = {'交易前': '1', '交易中': '2', '交易后': '3'}


def section_decomposition(sections):
    """
    问题分类结构整理
    :param blocks:
    :return:
    """
    res = []
    for step, step_values in sections.items():
        for block in step_values:
            for part, vals in block.items():
                if vals.__class__ is list:
                    for val in vals:
                        for sec_part, pattern in val.items():
                            res.append([step, part, sec_part, pattern])
                else:
                    res.append([step, part, part, vals])
    return res


def section_analize(data, sections, colname='Question', stats=True):
    """
    问题分类（粗粒度）
    :param data: 输入DataFrame
    :param sections: 分类
    :param colname: 默认列名，保存问题
    :return:
    """
    d = pd.DataFrame()
    decompositions = section_decomposition(sections)

    for dec in decompositions:
        idx = data[colname].apply(
            lambda string: True if type(string) is str and re.search(dec[-1], string.lower()) else False)
        s = data[idx]
        s['Flow'], s['Section'], s['Step'] = dec[0], dec[1], dec[2]
        d = d.append(s)
    d = d.reset_index()
    df = d.copy()
    # d['Flow'] = d['Flow'].apply(lambda x: section2num[x])
    if stats is False:
        return df
    d = d[[colname, 'Flow', 'Section', 'Step']]
    d.rename(columns={colname: 'Count'}, inplace=True)
    res = d.groupby(['Flow', 'Section', 'Step'])['Count'].count().reset_index().sort_values(by=['Flow', 'Count'])
    res_trend = d.groupby(['Flow', 'Section'])['Count'].count().reset_index().sort_values(by=['Flow', 'Count'])
    # res['Flow'] = res['Flow'].apply(lambda x: num2section[x])
    # res_trend['Flow'] = res_trend['Flow'].apply(lambda x: num2section[x])
    return res, res_trend, df


def subject_extract(dataframe, subject, colname='Question'):
    """
    主题词文本获取
    :param dataframe: 输入文件
    :param subject: 主题, 支持正则表达式
    :return: dataframe
    """
    idx = dataframe[colname].str.contains(subject)
    idx = idx.fillna(False)
    question = dataframe[idx].reset_index()
    return question


def frequence_analyze(dataframe, nums=30, title='全量', type_='Tokens', subject=''):
    """
    词频分析
    :param dataframe: 输入文件
    :param nums: 前nums个词频， 默认展示前30高的词频
    :param title: 词频主题
    :param type_: 分析分词还是Ngram, 默认为分词
    :param subject: 主题词频
    :return:
    """
    if title == '全量':
        data = dataframe.copy()
    else:
        data = subject_extract(dataframe, subject=title)

    words = (list(chain.from_iterable(row)) for row in filter(lambda x: x is not np.nan, data[type_]))
    freq = Counter(chain.from_iterable(words))
    df = pd.DataFrame(freq.most_common(nums), columns=['Words', 'Frequence'])
    plt.rcParams['font.sans-serif'] = ['Arial Unicode MS']
    fig, ax = plt.subplots(figsize=(15, 5), dpi=450)
    sns.barplot(x='Words', y='Frequence', data=df, ax=ax, capsize=10)
    ax.spines['left'].set_visible(False)
    ax.spines['right'].set_visible(False)
    ax.spines['top'].set_visible(False)
    ax.grid(linestyle='-.')
    plt.title('{}{}对话{}词频统计'.format(subject, title, type_))
    plt.xticks(rotation=30)
    plt.show()
    return df


def complaint_ratio(df, colname='Question'):
    """
    用户对话中的投诉占比分析
    :param df: 输入数据
    :param colname: 问题列名
    :return: 投诉占比
    """
    ts = subject_extract(df, '[投起]诉|公安|法院|警察|检察|举报', colname=colname)
    cp_ratio = pd.DataFrame({'投诉': [ts.shape[0]], '咨询': [df.shape[0]]})
    fig, ax = plt.subplots(figsize=(10, 5), dpi=200)
    plt.rcParams['font.sans-serif'] = ['Arial Unicode MS']
    x = (0, 1)
    colors = ['red', 'slateblue']
    ax.pie(cp_ratio.loc[0], labels=cp_ratio.columns, radius=1., autopct='%1.1f%%', colors=colors,
           pctdistance=0.8, startangle=90)
    ax.pie(x, radius=0.6, colors='w')
    plt.title('用户对话中的投诉占比')
    plt.show()
    return cp_ratio, ts


if __name__ == '__main__':
    zendeskfilepath = '/Users/fangzubing/downloads/Dialog/20210813df.csv'
    cols = ['Question', 'Timestamp', 'Visitor Email', 'Visitor Notes', 'country Name']
    zendesk = pd.read_csv(zendeskfilepath, usecols=cols)
    problem_classifier_count, problem_count, problem_data = section_analize(zendesk, section_problem,
                                                                            colname='Question')
